package com.teachmeskills.homework10.part1;
//Вывести на экран в одну строку два первых блока по 4 цифры
public class Homework10_1 {
   public static void main(String[] args) {
        String i = "1111-qWe-2222-RtY-1q2R";
        System.out.println(i.substring(0, 4) + i.substring(9, 13)); //#1
    }
}
